#include "../record.h"
/****************************************************************
 * 简单选择排序:
 * 每次选一个，和后面的比较。
 * 
 * 第一趟简单选择排序时,从第一个记录开始,通过n-1次关键字的比较,从n个记
 * 录中选出关键字最小的记录,并和第-一个记录进行交换;
 * 第二趟简单选择排序时,从第二个记录开始，通过n-2次关键字的比较,从n-1个
 * 记录中选出关键字最小的记录，并和第二个记录进行交换;
 * .......
 * 第i趟简单选择排序时,从第i个记录开始,通过n-i次关键字的比较,从n-i+1个
 * 记录中选出关键字最小的记录,并和第i个记录进行交换。如此反复,经过n-1趟
 * 简单选择排序,将把n-1个记录排到位,剩下一个最小记录直接在最后,所以共需
 * 进行n-1趟简单选择排序。
 * **************************************************************/

void SelectSort(RecordType r[], int length)
/*对记录数组r做简单选择排序，length为数组的长度*/
{
    int i, j, k;
    RecordType x;

    for(i = 1; i < length; ++i)
    {
        k = i;
        for(j = i+1; j <= length; ++j)  //找出这一趟的最小值，i是这一趟的第一个元素
            if(r[j].key < r[k].key)
                k = j;

        if(k != i)      //保护，避免自己和自己交换
        {
            x = r[i];       //交换
            r[i] = r[k];
            r[k] = x;
        }//end if
    }//end outside_for
} /* SelectSort  */